[
  {
    "name": "Local Language Audio Classification",
    "start_date": "2024-03-01",
    "end_date": "2024-05-01",
    "short_description": "Built a pre-processing process and model to classify local languages in Indonesia, as well as hyperparameter tuning by using Python and TensorFlow.",
    "description": "",
    "category": "AI",
    "tags": [
      "Python",
      "TensorFlow",
      "audio",
      "language",
      "tuning"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": false
  },
  {
    "name": "Cost Optimization",
    "start_date": "2023-09-01",
    "end_date": "2024-01-01",
    "short_description": "Analyzed and optimized all business flow, usecases logic, and resources, including cloud instances utilization, libraries, etc. The goal is to reduce cost usage as well as improve performance.",
    "description": "",
    "category": "Backend",
    "tags": [
      "cost",
      "optimization",
      "performance",
      "business",
      "cloud"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": false
  },
  {
    "name": "Fulfillment Handling Fee Deduction",
    "start_date": "2023-07-01",
    "end_date": "2023-10-01",
    "short_description": "Created a backend system using Go to calculate and real-time deduct a fulfillment handling fee from the seller for every finished transaction.",
    "description": "<p>DilayaniTokopedia (DT) is a trusted warehouse service provided by Tokopedia to process & send buyer orders to all regions in Indonesia with a guarantee of being safe & on time.</p><p>DT as of January 2023 has served more than 1,500 3P merchants from across categories and we charge the merchants several fees, such as storage fee and handling fee. However, there are gaps in the current pricing structure. In terms of handling fee, the different product dimensions & weights are currently charged the same handling fee, despite the different costs incurred to handle the items. So, to increase DT's take rate and to cross-monetize across the categories, DT would like to revamp the current charging schemes for handling fees.</p><p>In this project, I had a responsibility to be in charge as a PIC from my team. The objectives are:<ol><li>The handling fee charging will be determined by product category and size per product item.</li><li>Different product categories will have different charging % and min or max caps which can be configurable.</li><li>Different product sizes (dimension x weight) in the same category will have different charging rates %.</li></ol></p><p>I began by collecting all requirements, both functional and non-functional requirements. After I got detailed information about this project, I started brainstorming with my colleagues to find the solutions. Brainstorming is an essential process since I need to create a modular and scalable system for the business use cases in the future. After that, I created a comprehensive tech plan, from the background, solutions, functional changes, task breakdown, risk mitigation, release plan, etc. In the end, I also helped in the development and testing phase, as well as monitored the other tasks related to this project.</p><p>This project has several stakeholders, so we need to make sure all stakeholders have the same vision. Hence, we have a weekly meeting to monitor our progress. To ensure the correctness of the technical requirements, I helped and monitored the testing process. The QA team and I have regular check-ins to ensure the correctness and completeness of the testing coverage.</p><p>In the end, under my leadership, this project was released smoothly without a concerning issue. All the phases are completed within the timeline and all blockers can be solved together. After the release, this project generated a new income of more than IDR 100 million per day.</p>",
    "category": "Backend",
    "tags": [
      "Go",
      "fee",
      "deduction",
      "modular"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": true
  },
  {
    "name": "Survey Qualitative Analysis",
    "start_date": "2023-02-01",
    "end_date": "2023-04-01",
    "short_description": "Built a data pipeline and in-house AI model by using Python, TensorFlow, and Microsoft Azure to group the survey by doing sentiment analysis for every submitted Indonesian comment.",
    "description": "",
    "category": "AI",
    "tags": [
      "Python",
      "TensorFlow",
      "data",
      "LLMs"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": true
  },
  {
    "name": "Financial Automation Workflow",
    "start_date": "2022-11-01",
    "end_date": "2022-12-01",
    "short_description": "Provided consultation and solutions by using robotic process automation (RPA) to solve financial workflow problems from data collection to payment verification.",
    "description": "",
    "category": "Consulting",
    "tags": [
      "RPA",
      "automation",
      "finance",
      "workflow"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": true
  },
  {
    "name": "Tax Automation",
    "start_date": "2022-09-01",
    "end_date": "2022-11-01",
    "short_description": "Created a backend system to process tax invoices automatically. The process includes the KYC process, tax calculation, generating tax invoice to 3rd party, and sending the generated tax invoice.",
    "description": "",
    "category": "Backend",
    "tags": [
      "Go",
      "tax",
      "automation",
      "KYC"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": false
  },
  {
    "name": "Seller Reward Program Disbursement",
    "start_date": "2022-07-01",
    "end_date": "2022-08-01",
    "short_description": "Created a new backend app using Go to handle all the rewards. This project focuses on rewarding sellers based on sales results or merchant growth.",
    "description": "",
    "category": "Backend",
    "tags": [
      "Go",
      "reward",
      "disbursement"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": false
  },
  {
    "name": "Dynamic Commission Charging",
    "start_date": "2022-05-01",
    "end_date": "2022-07-01",
    "short_description": "Created a system using Go that enables commission charging based on the shop type and product category.",
    "description": "",
    "category": "Backend",
    "tags": [
      "Go",
      "commission",
      "deduction"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": false
  },
  {
    "name": "Charge and Payment Email Notification",
    "start_date": "2021-10-01",
    "end_date": "2021-11-01",
    "short_description": "Created a system that can send email notifications, such as invoice, reminder, and payment notifications. Invoice and charge notifications will be processed in batches, and payment notifications will be processed in stream.",
    "description": "",
    "category": "Full Stack",
    "tags": [
      "Java",
      "payment",
      "notification",
      "automation"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": false
  },
  {
    "name": "Zoom Synchronize",
    "start_date": "2020-07-01",
    "end_date": "2020-09-01",
    "short_description": "Created frontend & backend systems that can generate Zoom meeting links and integrate to another app for online teaching and learning purposes because of the impact of COVID-19.",
    "description": "",
    "category": "Full Stack",
    "tags": [
      "Java",
      "Zoom",
      "generate"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": false
  },
  {
    "name": "Student Payment using Virtual Account",
    "start_date": "2019-05-01",
    "end_date": "2019-07-01",
    "short_description": "Created a middleware by using .NET to integrate bank partner into the internal Java/Oracle PeopleSoft system to provide real-time payment using a virtual account.",
    "description": "",
    "category": "Backend",
    "tags": [
      ".NET",
      "Java",
      "payment",
      "va"
    ],
    "banner_url": "",
    "media": null,
    "is_home_display": true
  }
]
